StanislavLakhtin/esp32-pylon-battery-mqtt-probe/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=10

CONFIG_PROBE_WIFI_SSID="MY_WIFI_SSID"
CONFIG_PROBE_WIFI_PASS="MY_WIFI_PASS"

CONFIG_PROBE_NTP_SERVER="pool.ntp.org"
CONFIG_PROBE_NTP_UTC_OFFSET_MINUTES=180
CONFIG_PROBE_MQTT_BROKER_URI="192.168.7.77"

CONFIG_ESP_WIFI_AUTHMODE=WPA2_PSK
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BA_WIN=6
CONFIG_ESP32_WIFI_RX_BA_WIN=6
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_ESP_MQTT_CLIENT_BUFFER_SIZE=1024
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_NO_AFFINITY=0